// ~~~~~~~~~~~~~~~~~~ question's ~~~~~~~~~~~~~~~~~~~~~ //
const questions = {
	q1: [
		"سخت افزار به چه بخشی از کامپیوتر گفته می شود؟", //question
		4, //answer
		"قسمت های فلزی کامپیوتر", //option1
		"برد های الکترونیک و درایوها", //option2
		"وسایل فیزیکی کامپیوتر", //option3
		"هر سه مورد", //option4
	], 
	q2: [
		"خصوصیات بارز نسل سوم کامپیوترها چه بود ؟",
		3,
		"استفاده از ترانزیستورها",
		"استفاده از لامپ خلأ",
		"استفاده از مدارهای تجمع",
		"هیچکدام",
	],
	q3: [
		"وسایل ضبط اطلاعات بـا دسترسـی مسـتقیم و مـدارهای مجتمع از ویژگیهـای کـدامیک از هـای نسـل کامپیوتری است؟",
		3,
		"نسل اول",
		"نسل دوم",
		"نسل سوم",
		"هیچکدام",
	],
	q4: [
		"کامپیوتراولین الکترونیکی چه نام داشت ؟",
		2,
		"EDVAC",
		"ENIAC",
		"MARKI",
		"UNIVAC",
	],
	q5: [
		"واحد سرعت در کامپیوتر های شخصی عبارت است از ... ",
		3,
		"CPS",
		"LPM",
		"MIPS",
		"MIPC",
	],
	q6: [
		"وقتی برنامه ای وارد کامپیوتر می شود، این برنامه در کدام قسمت از حافظه قرار می گیرد؟",
		1,
		"RAM",
		"ROM",
		"EPROM",
		"هیچکدام",
	],
	q7: [
		"در کامپیوتر های 16 بیتی هر بایت برابر چند بیت است ؟",
		2,
		"16 bit",
		"8 bit",
		"32 bit",
		"4 bit",
	],
	q8: [
		"عملکرد داخلی کامپیوتر (از نظر محاسباتی و برنامه نویس ...)",
		2,
		"در مبنای 10 می باشد",
		"در مبنای 2 می باشد",
		"در مبنای 16 می باشد",
		"در مبنای 8 می باشد",
	],
	q9: [
		"فرق RAM و ROM در چیست؟",
		4,
		"هیچ تفاوتی با هم ندارند .",
		"ROM از نوع نیمه هادی و RAM از نوع مغناطیسی است .",
		"ROM فقط خواندنی است اما RAM فقط نوشتنی است .",
		"ROM فقط خواندنی است اما RAM خواندنی و نوشتنی است .",
	],
	q10: [
		"کار واحد ALU عبارتست از ...",
		4,
		"ذخیره کردن اطلاعات و انجام عملیات کنترلی لازم.",
		"انجام عملیات ریاضی",
		"انجام هر گونه اعمال منطقی",
		"موارد ب و ج",
	],
};
// ~~~~~~~~~~~~~~~~~~ /question's ~~~~~~~~~~~~~~~~~~~~~ // 